tap "aquasecurity/trivy"           # trivy（脆弱性スキャナ）の tap
tap "bufbuild/buf"                 # buf（Protocol Buffers ツール）の tap
tap "clojure/tools"                # Clojure 開発ツールの tap
tap "git-chglog/git-chglog"        # git-chglog（CHANGELOG 自動生成）の tap
tap "homebrew/bundle"              # Brewfile サポート
tap "homebrew/cask-versions"       # cask の旧バージョンを提供する tap
tap "sqldef/sqldef"                # sqldef（SQL スキーマ管理）の tap
tap "roborev-dev/tap"              # roborev（AI コードレビュー）の tap
tap "microsoft/apm"                # APM（AI エージェント依存管理）の tap
brew 'openssl'                     # SSL/TLS 暗号化ライブラリ
brew 'mas'                         # Mac App Store CLI
brew "automake"                    # Makefile 自動生成（autotools）
brew "awscli", link: false         # AWS サービスをコマンドラインで操作
brew "glib"                        # GObject/GIO コアライブラリ（依存）
brew "p11-kit"                     # PKCS#11 モジュール管理（依存）
brew "unbound"                     # DNS リゾルバ（依存）
brew "gnutls"                      # GNU TLS 暗号化ライブラリ（依存）
brew "emacs"                       # テキストエディタ（他ツールに依存されることも）
brew "cask"                        # Homebrew Cask 本体
brew "python@3.12"                 # Python 3.12
brew "direnv"                      # ディレクトリごとに .envrc を自動ロード
brew "docker"                      # コンテナランタイム
brew "docker-compose", link: false # 複数コンテナを yaml で定義・一括管理
brew "fd"                          # find の高速代替（Rust 製）
brew "harfbuzz"                    # テキストシェーピングライブラリ（依存）
brew "libass"                      # 字幕レンダリングライブラリ（ffmpeg 依存）
brew "pango"                       # テキストレイアウトライブラリ（依存）
brew "srt"                         # Secure Reliable Transport ライブラリ（ffmpeg 依存）
brew "tesseract"                   # OCR エンジン
brew "ffmpeg"                      # 動画・音声のエンコード・デコードツール
brew "gdk-pixbuf"                  # 画像読み込みライブラリ（依存）
brew "gh"                          # GitHub CLI
brew "ghq"                         # リポジトリを一元管理・clone するツール
brew "git"                         # バージョン管理システム
brew "chezmoi"                     # dotfiles 管理ツール
brew "go"                          # Go 言語
brew "gobject-introspection"       # GObject バインディング生成（依存）
brew "gts"                         # GNU Triangulated Surface Library（依存）
brew "librsvg"                     # SVG レンダリングライブラリ（依存）
brew "graphviz"                    # DOT 言語でグラフを可視化するツール
brew "grep"                        # テキスト検索（GNU grep）
brew "guile"                       # GNU Scheme 実装（依存）
brew "jq"                          # JSON を整形・加工する CLI ツール
brew "k6"                          # シナリオベースの負荷テストツール
brew "libfido2"                    # FIDO2/WebAuthn ライブラリ（依存）
brew "libssh"                      # SSH 実装ライブラリ（依存）
brew "maven"                       # Java ビルド・依存管理ツール
brew "meilisearch"                 # 全文検索エンジン
brew "mkcert"                      # ローカル開発用 SSL 証明書を簡単発行
brew "mysql-client"                # MySQL クライアント CLI
brew "mydumper"                    # MySQL 高速バックアップ・リストアツール
brew "mysql"                       # MySQL データベース
brew "nghttp2"                     # HTTP/2 実装ライブラリ（依存）
brew "nvm"                         # Node.js バージョン管理
brew "plantuml"                    # テキスト記述から UML 図を生成
brew "redis"                       # インメモリ KVS・キャッシュ・メッセージキュー
brew "sqlc"                        # SQL からタイプセーフな Go コードを自動生成
brew "tfenv"                       # Terraform バージョン管理ツール
brew "tmux"                        # ターミナルマルチプレクサ
brew "tree"                        # ディレクトリ構造をツリー表示
brew "wget"                        # HTTP/FTP ファイルダウンロード
brew "wireshark"                   # パケットキャプチャ・ネットワーク解析ツール
brew "zsh-autosuggestions"         # 入力中のコマンドを履歴から提案
brew "zsh-completions"             # zsh 用の追加補完定義
brew "zsh-syntax-highlighting"     # zsh コマンドをリアルタイムでハイライト
brew "aquasecurity/trivy/trivy"    # コンテナ・IaC の脆弱性スキャナ
brew "clojure/tools/clojure"       # Clojure 言語
brew "git-chglog/git-chglog/git-chglog" # git log から CHANGELOG を自動生成
brew "leiningen"                   # Clojure のビルド・依存管理ツール
brew "lazygit"                     # Git 操作を TUI で快適にする
brew "lazydocker"                  # Docker / docker-compose を TUI で操作
brew "tmuxp"                       # tmux セッションを YAML で定義・自動起動
brew "ghostty"                     # 高速・GPU 描画対応の次世代ターミナル
brew "sk"                          # skim: fzf 互換の高速ファジーファインダ
brew "fzf"                         # ファジーファインダ（定番）
brew "zoxide"                      # cd を賢くするディレクトリジャンプツール
brew "csvlens"                     # CSV を TUI で可視化・閲覧
brew "tailscale"                   # インターネット越しに安全な仮想 LAN を構築
brew "mise"                        # 開発言語・ツールのバージョンを一元管理
brew "mosh"                        # 不安定な回線でも落ちないリモート接続ツール
# Automatic code review daemon for git commits using AI agents
brew "roborev-dev/tap/roborev"
# Fast Git hook manager written in Rust, drop-in alternative to pre-commit
brew "prek"
# AI agent dependency manager (package.json for AI agents)
brew "microsoft/apm/apm"

cask "google-chrome"               # Google Chrome ブラウザ
cask "google-japanese-ime"         # Google 日本語入力
cask "karabiner-elements"          # キーボードカスタマイズツール
cask "ngrok"                       # ローカルサーバーを外部公開するトンネリングツール
cask "slack"                       # チームコミュニケーションツール
cask 'zoom'                        # ビデオ会議ツール
cask 'obsidian'                    # マークダウンベースのノートアプリ
cask 'visual-studio-code'          # テキストエディタ / IDE
cask 'discord'                     # コミュニティ向けチャットツール
cask 'orbstack'                    # 軽量・高速なコンテナ / Linux VM 管理（Docker Desktop 代替）
cask 'tomatobar'                   # メニューバーのポモドーロタイマー
cask 'cmux'                        # Ghostty ベースのターミナル（縦タブ・AI エージェント通知対応）

mas 'Xcode', id: 497799835         # Apple 公式 IDE
mas 'Kindle', id: 302584613        # Kindle リーダー
mas 'Tailscale', id: 1475387142    # Tailscale VPN クライアント（GUI 版）
